Revit 2024 API
FileDialog Members
The FileDialog type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FileDialog
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSelectedModelPath
 Returns the selected file path chosen by the user.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidFilterString
 Determines if the input string is acceptable as input for a FileDialog filter string.
Show
 Shows the dialog using the stored settings.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
DefaultFilterEntry
 The default entry (from the filter) to be selected in the dialog.
Filter
 The filter string representing a collection of extensions allowed by the dialog.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Title
 The title to show on the dialog.
See Also
FileDialog Class
Autodesk.Revit.UI Namespace